const jobSkills = {
  '개발자/IT개발·데이터': [
    '자바', '파이썬', '자바스크립트', '리액트',
    'SQL', '데이터 분석', '빅데이터', '머신러닝',
    'HTML', 'CSS', 'Node.js', 'Angular',
    'Vue.js', 'C#', '.NET', 'PHP',
    'Ruby', 'Go', 'TypeScript', 'Kotlin',
    'Swift', 'Docker', 'Kubernetes', 'AWS',
    'Azure', 'Google Cloud', 'Git', 'Jenkins',
    'TensorFlow', 'PyTorch', 'SAS', 'SPSS'
  ],
  '디자이너': ['어도비 포토샵', '스케치', '인디자인', '일러스트레이터'],
  '기획·전략': ['MS Office', '프로젝트 관리', 'SWOT 분석', '마인드맵 도구'],
  '상품기획·MD': ['시장 분석', '트렌드 분석', '재고 관리', '가격 전략'],
  '의료': ['임상 지식', '의료 기기 사용', '환자 관리', '의약품 지식'],
  '마케팅·홍보·조사': ['SNS 운영', '구글 애널리틱스', 'SEO', '콘텐츠 마케팅'],
  '운전·운송·배송': ['운전 면허증', '차량 유지 관리', '지리적 지식', '시간 관리'],
  '연구·R&D': ['실험 설계', '데이터 분석', '통계 소프트웨어', '연구 보고서 작성'],
  '회계·세무·재무': ['회계 소프트웨어', '재무 분석', '세무 계획', '예산 관리'],
  '영업·판매·무역': ['고객 관리', '협상 기술', '시장 분석', '제품 지식'],
  '서비스': ['고객 서비스', '문제 해결', '피드백 관리', '서비스 마인드'],
  '교육': ['교육 기획', '강의 기술', '교육 자료 개발', '학생 평가'],
  '인사·노무·HRD': ['인사 관리', '노무 관리', '교육 프로그램 개발', '성과 평가 시스템'],
  '고객상담·TM': ['통신 기술', '고객 상담', '문제 해결', '상품 지식'],
  '생산': ['생산 계획', '품질 관리', '장비 운용', '안전 관리'],
  '미디어·문화·스포츠': ['콘텐츠 제작', '편집 소프트웨어', '이벤트 기획', '브랜딩'],
  '총무·법무·사무': ['문서 관리', '법적 지식', '사무 기기 운용', '일정 관리'],
  '구매·자재·물류': ['재고 관리', '공급망 관리', '구매 협상', '물류 계획'],
  '건설·건축': ['CAD 소프트웨어', '건축 설계', '프로젝트 관리', '안전 규정 지식'],
  '금융·보험': [
    '금융 분석', '위험 관리', '투자 전략', '보험 상품 지식',
    '시장 동향 분석', '규제 지식', '고객 관리', '자산 관리'
  ]
};

export default jobSkills;
